tap 'homebrew/bundle'
tap 'homebrew/services'

tap 'oven-sh/bun'
brew 'bun'

brew 'asdf'
brew 'aspell'
brew 'bat'
brew 'cmake'
# Needed for building native ruby gems occasionally
brew 'coreutils'
brew 'difftastic'
brew 'fzf'
brew 'gpg'
brew 'gum'
brew 'jj'
brew 'jjui'
brew 'lazygit'
brew 'libyaml' # Needed for building ruby with asdf
brew 'mas'
brew 'neovim'
brew 'pandoc'
brew 'postgresql'
brew 'prettier'
brew 'proselint'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'sqlite'
brew 'spaceship'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'yarn'
brew 'yt-dlp'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'

# Kicking the tires on these
brew 'clojure/tools/clojure'

cask_args appdir: '/Applications'

# Quicklook for plain text files
cask 'qlstephen'

# Applications
cask '1password-cli'
cask 'alfred'
cask 'arc'
cask 'aws-vault'
cask 'bike'
cask 'betterzip'
cask 'chatgpt'
cask 'choosy'
cask 'claude'
cask 'cleanshot'
cask 'dash'
cask 'expressvpn'
cask 'fantastical'
cask 'firefox'
cask 'fork'
cask 'git-credential-manager'
cask 'ghostty'
cask 'imageoptim'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'marked'
cask 'mimestream'
cask 'monodraw'
cask 'moom'
cask 'mutedeck'
cask 'omnigraffle'
cask 'postico'
cask 'raycast'
cask 'retcon'
cask 'sequel-pro'
cask 'signal'
cask 'soulver'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'webcatalog'
cask 'zed'
cask 'zoom'
# These are already installed by JAMF
# cask 'google-chrome'
# cask 'slack'

