tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'railwaycat/emacsmacport'
tap 'heroku/brew'

brew 'asdf'
brew 'aspell'
brew 'awscli'
brew 'bat'
brew 'cmake'
brew 'difftastic'
brew 'fzf'
brew 'gpg'
brew 'heroku'
brew 'neovim'
brew 'pandoc'
brew 'postgresql'
brew 'proselint'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'sqlite'
brew 'spaceship'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'

# Kicking the tires on these
brew 'exercism'
brew 'clojure/tools/clojure'

cask_args appdir: '/Applications'

# Quicklook for plain text files
cask 'qlstephen'

# Applications
#cask 'emacs'
cask '1password'
cask 'airbuddy'
cask 'alfred'
cask 'aws-vault'
cask 'betterzip'
cask 'choosy'
cask 'cleanshot'
cask 'dash'
cask 'deckset'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'emacs-mac'
cask 'expressvpn'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'grammarly'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keybase'
cask 'kindle'
cask 'licecap'
cask 'mailplane'
cask 'marked'
cask 'monodraw'
cask 'moom'
cask 'omnigraffle'
cask 'postico'
cask 'sequel-pro'
# Failing as of 2021-09-10
# cask 'sizzy'
cask 'signal'
cask 'sketch'
cask 'soulver'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tableplus'
cask 'toggl-track'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
# These are already installed by JAMF
# cask 'google-chrome'
# cask 'zoom'
# cask 'slack'

tap 'argon/homebrew-mas'
mas 'Affinity Photo', id: 824183456
mas 'Bear', id: 1091189122
mas 'Clocks', id: 414554506
mas 'Day One', id: 1055511498
mas 'MindNode 6', id: 1289197285
# Failing as of 2021-09-10
# mas 'NotePlan 3: Markdown Planner', id: 150543262
mas 'TextSniper - OCR simplified', id: 1528890965
mas 'Things 3', id: 904280696
mas 'Ulysses', id: 1225570693
mas 'White Noise', id: 415139197
