
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'argon/homebrew-mas'

brew 'ansible'
brew 'aspell'
brew 'awscli'
brew 'chisel'
brew 'ctags'
brew 'diff-so-fancy'
brew 'ripgrep'
brew 'fzf'
brew 'yarn'
brew 'graphviz'

brew 'dnsmasq', restart_service: :changed

brew 'asdf'
brew 'figlet'
brew 'git'
brew 'gnupg2'
brew 'libxml2'
brew 'gnu-sed'
brew 'htop-osx'
brew 'heroku'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'keybase'
brew 'leiningen'
brew 'macvim'
brew 'mercurial'
brew 'openssl'
brew 'pandoc'

brew 'postgresql', restart_service: :changed

brew 'pstree'
brew 'python'
brew 'reattach-to-user-namespace', args: [ 'with-wrap-pbcopy-and-pbpaste' ]
brew 'rust'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmate'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'vim', args: [ 'with-ruby', 'with-mzscheme', 'with-python' ]
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick', 'with-dbus', 'with-modules', 'with-mailutils' ]
