tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'wallix/awless'
tap 'railwaycat/emacsmacport'
tap 'heroku/brew'

brew 'asdf'
brew 'aspell'
brew 'awless'
brew 'awscli'
brew 'bat'
brew 'bkt'
brew 'ctags'
brew 'delta'
brew 'difftastic'
brew 'fzf'
brew 'git'
brew 'graphviz'
brew 'grex'
brew 'heroku'
brew 'httpie'
brew 'jq'
brew 'pandoc'
brew 'postgresql', restart_service: :changed
brew 'proselint'
brew 'pstree'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby-build'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'

cask_args appdir: '/Applications'

# Quicklook for plaintext files
cask 'qlstephen'

# Applications
# cask '1password'
cask 'sequel-pro'
cask 'cleanshot'
cask 'aws-vault'
cask 'betterzip'
cask 'postico'
cask 'firefox'
cask 'alfred'
cask 'dash'
cask 'deckset'
cask 'docker'
#cask 'emacs'
cask 'emacs-mac'
cask 'flux'
cask 'imageoptim'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keybase'
cask 'kindle'
cask 'licecap'
cask 'mailplane'
cask 'marked'
cask 'monodraw'
cask 'moom'
cask 'omnigraffle'
cask 'slack'
cask 'soulver'
cask 'spotify'
cask 'toggl-track'
cask 'superduper'
cask 'visual-studio-code'
cask 'vlc'

tap 'argon/homebrew-mas'
mas 'Bear', id: 1091189122
mas 'Affinity Photo', id: 824183456
mas 'Capo 3', id: 696977615
mas 'Clocks', id: 414554506
mas 'Color Picker', id: 502401013
mas 'Day One', id: 1055511498
mas 'MindNode 6', id: 1289197285
mas 'Things 3', id: 904280696
mas 'Ulysses', id: 1225570693
mas 'White Noise', id: 415139197
