tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'heroku/brew'

brew 'asdf'
brew 'aspell'
brew 'awscli'
brew 'bat'
brew 'bkt'
brew 'cmake'
brew 'flyctl'
brew 'fzf'
brew 'heroku'
brew 'neovim'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'

cask_args appdir: '/Applications'

# Quicklook for plain text files
cask 'qlstephen'

# Applications
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'betterzip'
cask 'brave-browser'
cask 'adobe-creative-cloud'
cask 'caffeine'
cask 'calibre'
cask 'cleanshot'
cask 'dash'
cask 'deckset'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'expressvpn'
cask 'fantastical'
cask 'flux'
cask 'google-chrome'
cask 'grammarly'
cask 'imageoptim'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'mailplane'
cask 'marked'
cask 'monodraw'
cask 'moom'
cask 'nova'
cask 'omnigraffle'
cask 'postico'
cask 'sabnzbd'
cask 'slack'
cask 'soulver'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tableplus'
cask 'textbuddy'
cask 'toggl-track'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

tap 'argon/homebrew-mas'
mas 'Bear', id: 1091189122
mas 'Color Picker', id: 502401013
mas 'Day One', id: 1055511498
mas 'MindNode 6', id: 1289197285
mas 'NotePlan 3: Markdown Planner', id: 150543262
mas 'Things 3', id: 904280696
mas 'Ulysses', id: 1225570693
