tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'wallix/awless'
tap 'railwaycat/emacsmacport'
tap 'heroku/brew'

brew 'asdf'
brew 'aspell'
brew 'awless'
brew 'awscli'
brew 'bat'
brew 'cmake'
brew 'fzf'
brew 'heroku'
brew 'github/gh/gh'
brew 'pandoc'
brew 'proselint'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'

cask_args appdir: '/Applications'

cask 'aws-vault'
cask 'betterzip'
cask 'postico'
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'webpquicklook'

# Applications
# cask '1password'
cask 'alfred'
cask 'dash'
cask 'deckset'
cask 'docker'
#cask 'emacs'
cask 'emacs-mac'
cask 'flux'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keybase'
cask 'kindle'
cask 'licecap'
cask 'mailplane'
cask 'marked'
cask 'monodraw'
cask 'moom'
cask 'omnigraffle'
cask 'slack'
cask 'soulver'
cask 'spotify'
cask 'superduper'
cask 'textexpander'
cask 'visual-studio-code'
cask 'vlc'

tap 'argon/homebrew-mas'
mas 'Affinity Photo', id: 824183456
mas 'Clocks', id: 414554506
mas 'Color Picker', id: 502401013
mas 'Day One', id: 1055511498
mas 'MindNode 6', id: 1289197285
mas 'Monosnap', id: 540348655
mas 'Things 3', id: 904280696
mas 'Ulysses', id: 1225570693
mas 'White Noise', id: 415139197
